
/*
문제
===========================
두 개의 자연수를 입력받아 최대 공약수와 최소 공배수를 출력하는 프로그램을 작성하시오.

입력
===========================
첫째 줄에는 두 개의 자연수가 주어진다. 이 둘은 10,000이하의 자연수이며 사이에 한 칸의 공백이 주어진다.

출력
===========================
첫째 줄에는 입력으로 주어진 두 수의 최대공약수를, 둘째 줄에는 입력으로 주어진 두 수의 최소 공배수를 출력한다.

제한
============================


예제 입력1
============================
24 18

예제 출력1
============================
6
72

예제 입력2
============================


예제 출력2
============================

*/

// 나의 답안
// ============================

#include <iostream>
using namespace std;

int gcd(int a,int b){
    int r;
    while(b != 0){
        r = a%b;
        a = b;
        b = r;
    }
    return a;
}

int lcm(int a, int b){
    return a/gcd(a,b) * b;
}

int main(){
    int a,b;
    cin >> a >> b;

    int g = gcd(a,b);
    int l = lcm(a,b);

    cout << g << endl;
    cout << l << endl;

    return 0;
}